def task_1():
    """1. В диапазоне натуральных чисел от 2 до 99 определить,
     сколько из них кратны каждому из чисел в диапазоне от 2 до 9."""

    for num in range(2, 10):
        print(f'{num}: {len([el for el in range(2, 100) if el % num == 0])}')


def task_2():
    """2. Во втором массиве сохранить индексы четных элементов первого массива.
    Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
    надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается
    с нуля), т.к. именно в этих позициях первого массива стоят четные числа."""


def task_3():
    """3. В массиве случайных целых чисел поменять местами минимальный и максимальный элементы."""


def task_4():
    """4. Определить, какое число в массиве встречается чаще всего."""


def task_5():
    """5. В массиве найти максимальный отрицательный элемент.
    Вывести на экран его значение и позицию в массиве."""


def task_6():
    """6. В одномерном массиве найти сумму элементов, находящихся между минимальным и максимальным элементами.
    Сами минимальный и максимальный элементы в сумму не включать."""


def task_7():
    """7. В одномерном массиве целых чисел определить два наименьших элемента.
    Они могут быть как равны между собой (оба являться минимальными), так и различаться."""


def task_8():
    """8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
    Программа должна вычислять сумму введенных элементов каждой строки и записывать ее
    в последнюю ячейку строки. В конце следует вывести полученную матрицу."""


def task_9():
    """9. Найти максимальный элемент среди минимальных элементов столбцов матрицы."""


if __name__ == '__main__':
    task_1()
    # task_2()
    # task_3()
    # task_4()
    # task_5()
    # task_6()
    # task_7()
    # task_8()
    # task_9()
