from random import randint, uniform


def task_1() -> None:
    """1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь."""

    nums = input('Введине трёхзначное число: ')
    if len(nums) == 3:
        a, b, c = (int(el) for el in nums)
        print(f'Сумма цифр числа: {sum([a, b, c])}')
        print(f'Произведение цифр числа: {a * b * c}')
    else:
        print(f'Введено не трёхзначное число: {nums}.\nДавай Досвидания!')


def task_2() -> None:
    """2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
    Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
    Объяснить полученный результат."""

    num_1 = 5
    num_2 = 6
    print(f'Логическая операция "И": {num_1 & num_2}')
    print(f'Логическая операция "ИЛИ": {num_1 | num_2}')
    print(f'Логическая операция "Исключительное ИЛИ": {num_1 ^ num_2}')
    print(f'Комплиментарный оператор, число {num_1}: {~ num_1}')
    print(f'Комплиментарный оператор, число {num_2} : {~ num_2}')
    print(f'Побитовый сдвиг вправо, число {num_1}  на 2 знака: {num_1 >> 2}')
    print(f'Побитовый сдвиг влево, число {num_1} на 2 знака: {num_1 << 2}')


def task_3() -> None:
    """3. По введенным пользователем координатам двух точек вывести
     уравнение прямой вида y=kx+b, проходящей через эти точки."""

    x_1, y_1 = map(float, input('Введите координату 1й точки: ').split())
    x_2, y_2 = map(float, input('Введите координату 1й точки: ').split())
    if x_1 - x_2 != 0:
        k = (y_1 - y_2) / (x_1 - x_2)
        b = y_1 - k * x_1
        print(f'Уравнение прямой: y={k}x+{b}')
    else:
        print('Некорректно введены координаты')


def task_4() -> None:
    """4. Написать программу, которая генерирует в указанных пользователем границах:
    случайное целое число;
    случайное вещественное число;
    случайный символ."""

    print('1 - случайное целое число'
          '\n2 - случайное вещественное число'
          '\n3 - случайный символ')

    case, start, end = input('Введите что сгенерировать и границы: ').split()
    if case == '3' and start.isalpha() and end.isalpha():
        result = chr(randint(ord(start), ord(end)))
    elif int(case) in [1, 2] and not start.isalpha() and not end.isalpha():
        result = round(uniform(float(start), float(end)), 2)
        if case == '1':
            result = int(result)
    else:
        result = 'введены некорректные данные'
    print(f'Результат: {result}')


def task_5() -> None:
    """5. Пользователь вводит две буквы. Определить, на каких местах
     алфавита они стоят и сколько между ними находится букв."""

    chars = input('Введите две латинские буквы: ').split()
    pos_char1, pos_char2 = map(lambda x: ord(x) - 96, chars)
    result = pos_char2 - pos_char1 - 1 if pos_char1 < pos_char2 else pos_char1 - pos_char2 - 1
    print(f'{chars[0]}: {pos_char1}, {chars[1]}: {pos_char2},\nкол-во букв между ними: {result}')


def task_6() -> None:
    """6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква."""

    number = input('Введите номер позиции буквы от 1 до 26 включительно: ')
    if number.isdigit() and 1 <= int(number) <= 26:
        print(f'{number} -> {chr(96 + int(number))}')
    else:
        print('Введена некоректная информация. В лат. алфавите 26 букв.')


def task_7() -> None:
    """7. По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника,
     составленного из этих отрезков. Если такой треугольник существует, то определить, является ли он разносторонним,
      равнобедренным или равносторонним."""

    a, b, c = map(float, input('Введите длины трёх отрезков: ').split())
    if a > 0 and b > 0 and c > 0:
        if a == b == c:
            print('Треугольник равносторонний')
        elif a == b or b == c or a == c:
            print('Треугольник равнобедренный')
        else:
            print('Треугольник разносторонний')
    else:
        print('Введены некорректные данные')


def task_8() -> None:
    """8. Определить, является ли год, который ввел пользователем, високосным или невисокосным."""

    year = int(input('Ведите год: '))
    if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
        print('Год високосный')
    else:
        print('Год не високосный')


def task_9() -> None:
    """9. Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого)."""

    num1, num2, num3 = map(float, input('Введите три числа: ').split())
    mid_num = num1
    if num1 < num2 < num3 or num3 < num2 < num1:
        mid_num = num2
    elif num1 < num3 < num2 or num2 < num3 < num1:
        mid_num = num3
    else:
        mid_num = 'среди чисел нет среднего'
    print(f'Результат: {mid_num}')


if __name__ == "__main__":
    task_1()
    # task_2()
    # task_3()
    # task_4()
    # task_5()
    # task_6()
    # task_7()
    # task_8()
    # task_9()
